<?php
//引用参数

//在PHP 中引用的意思是：不同的名字访问同一个变量内容.


// $a=10;
// $b=$a;
// $b=100;
// echo $a;//输出10
$a=10;
$b=&$a;//&取地址符  把&a的地址给$b;相当于$a和%b指向同一个变量
echo $b."<br>";//$b就等于10
$b=100;//改变了$b,就相当于改变了$a
echo $a."<br>";//$a的值被改为100了





// $i=50;
// function show(){
// 	global $i; //global将全局变量$i传进来
// 	$i++;
// }
// show();
// echo $i."<br>";//结果输出51,

// $i=50;
// function show($i){
// 	$i++;
// }
// show($i);
// echo $i."<br>";//输出50,并不能把$i传进去

// $i=50;
// function show(&$i){
// 	$i++;
// }
// show($i);
// echo $i."<br>";//输出51,把$i传进去了


function &test(){
	static $i=1;//静态变量
	$i++;
	echo '$i的值为'.$i;
	return $i;//返回$i的值
}
$m=test();//输出$i的值为2,
echo '$m的值为'.$m."<br>";//$m的值为2
$m=5;
echo '$m的值为'.$m."<br>";//$m的值为5
$m=test();//输出$i的值为3,
echo '$m的值为'.$m."<br>";//$m的值为3
$m=&test();//输出$i的值为4,同时把$m和$i指向了同一个地方
echo '$m的值为'.$m."<br>";//$m的值为4
$m=20;//此时改变$m的值就会改变$i的值
echo '$m的值为'.$m."<br>";//$m的值为20
$m=test();//输出$i的值为21,此时$i的值为改变了
echo '$m的值为'.$m."<br>";//$m的值为21

 ?>
